In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({
    'Sex' : ['M','F','F','D','?'],
    'Age' : [29,30,24,290,25]
})

df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [5]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [6]:
df['Sex'].value_counts()

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [7]:
df['Sex'].replace('D','F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [8]:
df.replace({
    'Sex': {
        'D':'F',
        'M':'N'
    },
    'Age' : {
        290:29
    }
})

  Sex  Age
0   N   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [9]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [10]:
df[df['Age']>100]

  Sex  Age
3   D  290

In [11]:
df.loc[df['Age']>100, 'Age'] = df.loc[df['Age']>100,'Age']/10

In [12]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [13]:
df.loc[~df['Sex'].isin(['M', 'F']), 'Sex'] = 'NA'

In [14]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3  NA   29
4  NA   25

Handling Duplicates

In [15]:
ambassadors = pd.Series([
    'France',
    'UK',
    'UK',
    'Italy',
    'Germany',
    'Germany',
    'Germany'], index = [
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

In [16]:
ambassadors

Gérard Araud           France
Kim Darroch                UK
Peter Westmacott           UK
Armando Varricchio      Italy
Peter Wittig          Germany
Peter Ammon           Germany
Klaus Scharioth       Germany
dtype: object

In [17]:
ambassadors.duplicated(keep = 'last')

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [18]:
ambassadors.duplicated(keep = False)

Gérard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [19]:
ambassadors.drop_duplicates()

Gérard Araud           France
Kim Darroch                UK
Armando Varricchio      Italy
Peter Wittig          Germany
dtype: object

In [20]:
ambassadors.drop_duplicates(keep = 'last')

Gérard Araud           France
Peter Westmacott           UK
Armando Varricchio      Italy
Klaus Scharioth       Germany
dtype: object

In [21]:
ambassadors

Gérard Araud           France
Kim Darroch                UK
Peter Westmacott           UK
Armando Varricchio      Italy
Peter Wittig          Germany
Peter Ammon           Germany
Klaus Scharioth       Germany
dtype: object

In [22]:
ambassadors.drop_duplicates(keep = False)

Gérard Araud          France
Armando Varricchio     Italy
dtype: object

In [23]:
players = pd.DataFrame({
    'Name' : [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos' : [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [24]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [25]:
players.duplicated(subset = ['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [26]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [27]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [28]:
players.drop_duplicates(subset = ['Name'])

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF

Text Handling

In [29]:
df = pd.DataFrame({
    'Data' : [
       '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2' 
    ]
})

In [30]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [31]:
# Year, Sex, Country, Number of Children

In [32]:
df = df['Data'].str.split('_',expand=True)

In [33]:
df.columns = ['Year', 'Sex', 'Country', 'No. of Children']

In [34]:
df

    Year Sex Country No. of Children
0   1987   M     US                1
1  1990?   M      UK               1
2   1992   F      US               2
3  1970?   M      IT               1
4   1985   F    I  T               2

In [35]:
df['Year'].str.contains('\?')

<>:1: SyntaxWarning: invalid escape sequence '\?'
<>:1: SyntaxWarning: invalid escape sequence '\?'
C:\Users\Khush Bhuta\AppData\Local\Temp\ipykernel_11572\681321257.py:1: SyntaxWarning: invalid escape sequence '\?'
  df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [36]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [37]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [38]:
#replacing whitespaces/ eliminating them
df['Country'].str.replace(' ','')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [39]:
df

    Year Sex Country No. of Children
0   1987   M     US                1
1  1990?   M      UK               1
2   1992   F      US               2
3  1970?   M      IT               1
4   1985   F    I  T               2

In [40]:
#we can use REGEX to replace the ? in year

In [43]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'), regex = True)

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object